d_sentences = {"мольба": [("начало",
                           "Из-за конфликта, произошедшего между p1 и p2,  p1 начал преследовать p2 и угрожать ему. Вся жизнь p2 свелась к попыткам спастись от p1. ",
                           "Воспользовавшись слабостью и беспомощностью  p2, p1 напал на него, но  p2 удалось сбежать. "),
                          ("середина",
                           "В отчаянии p2 обратился за помощью к p3, который смог бы защитить его от p1.",
                           "Спасаясь от p1,  p2, попросил о помощи p3.",
                           "Вконец отчаявшись справится с p1, p2 попросил о помощи у p3, надеясь на его защиту и покровительство."),
                          ("конец",
                           "p3 долго колебался, но всё-таки решился помочь p2 и спас его от p1."
                           "p2 долго умолял о помощи p3, и тот в конце концов согласился ему помочь.",
                           "p3 не сразу решился помочь p2, однако узнав подробнее  о его беде, тут же отбросил все сомнения и помог ему.")],
               "спасение": [("начало",
                             'p1 попал в беду. Было ли это просто стечением обстоятельств или же чьим-то злым умыслом: этого мы никогда уже не узнаем.',
                             'p1 стал жертвой p2.',
                             'p2 воспользовался слабостью  p1 и напал на него.'
                             ), ("середина",
                                 'p1 казалось, что из этой ситуации выхода нет, ти судьба у него только одна –  смерть.',
                                 'p1 совсем отчаялся и перестал бороться, у него опускались руки от одной только мысли о продолженим этой бессмысленной, как ему казалось, борьбы.',
                                 'p1 уже опустились руки, и он перестал надеяться на хороший исход, ведь чего он только не испробовал в надежде на спасение.'
                                 ), ("конец",
                                     'p1 казалось, что из этой ситуации выхода нет, ти судьба у него только одна –  смерть.',
                                     'p1 совсем отчаялся и перестал бороться, у него опускались руки от одной только мысли о продолженим этой бессмысленной, как ему казалось, борьбы.',
                                     'p1 уже опустились руки, и он перестал надеяться на хороший исход, ведь чего он только не испробовал в надежде на спасение.'
                                     )],
               "месть": [("начало", 'p1 уже давно лелеял мечту о мести p2 за совершенное им преступление.',
                          'p1 желал отомстить p2 за то преступление, что он совершил.',
                          'Однажды p2 совершил преступление, и  p1 уже долгое время  хотел отомстить ему за это.'
                          ), ("середина", 'p2  долго укрывался от p1, боясь наказания сейчас своё преступления.',
                              'p2 осознавал вину за содеянное им преступление, его мучала совесть, он не знал, куда деться от этого. '
                              ), ("конец", 'p1 совершил задуманную месть, однако удовлетворения от неё он не получил.',
                                  'p2 всё же смог избежать наказания, несмотря на все старания p1.',
                                  'p2 раскаялся в своих преступления и был прощен p1.'
                                  )],
               'мятеж': [('', 'p1 правил своей страной долго и беспощадно, не жалея своих подданных.',
                          'p1 уже долгое врем, тиранил своих подданных, жестоко распоряжаясь их судьбами.'),
                         ('', 'p1 нужно было положить конец.',
                          'p2 решил свергнуть власть и покончить с деспотизмом p1',
                          'p2 вместе со своими единомышленниками решил покончить с p1 и установить свою власть.'
                          ), ('', 'Заговор p2 был раскрыт  p1, и все его участники были убиты.',
                              'Несмотря на все трудности, p2 добился своего и сверг p1.',
                              'p2, устроив мятеж, сверг p1 и установил свою власть.'
                              )],
               'загадка': [('',
                            'p2 всегда любил разгадывать загадки, решать ребусы, и та задача, заданная p1 не стала исключением.',
                            'Загадка, загаданная p2 p1 была совершенно иной, не похожей на все остальные.',
                            'p2 предстояло разгадать тайну, оставленный им p1'
                            ), ('', 'p2 дни и ночи ломал голову над тайной.',
                                'p1 постарался на славу, эта загадка была трудна.'
                                ), ('', 'Как не старался p2 не смог разгадать эту тайну.',
                                    'Хоть загадка и была трудной, но p2 всё же справился с ней.'
                                    )]}
